Lucas4lmeida/ESP-Guard-Vision/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_WIFI_SSID="Lucas"
CONFIG_EXAMPLE_WIFI_PASSWORD="12345678"
CONFIG_EXAMPLE_CONNECT_IPV6=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y
CONFIG_ESP_WIFI_SLP_IRAM_OPT=y
CONFIG_PIX_CVT_RGB565_TO_GRAY_SUPPORT=n
CONFIG_PIX_CVT_RGB565_TO_HSV_SUPPORT=n
CONFIG_PIX_CVT_RGB888_TO_RGB888_SUPPORT=n
CONFIG_PIX_CVT_RGB888_TO_RGB565_SUPPORT=n
CONFIG_PIX_CVT_RGB888_TO_GRAY_SUPPORT=n
CONFIG_PIX_CVT_RGB888_TO_HSV_SUPPORT=n
CONFIG_PIX_CVT_GRAY_TO_GRAY_SUPPORT=n
CONFIG_PIX_CVT_HSV_TO_HSV_MASK_SUPPORT=n
CONFIG_PIX_CVT_YUV_TO_RGB888_SUPPORT=n
CONFIG_PIX_CVT_YUV_TO_RGB565_SUPPORT=n
CONFIG_PIX_CVT_YUV_TO_GRAY_SUPPORT=n
CONFIG_PIX_CVT_YUV_TO_HSV_SUPPORT=n
CONFIG_PIX_CVT_YUV_TO_YUV_SUPPORT=n
CONFIG_OV7670_SUPPORT=n
CONFIG_OV7725_SUPPORT=n
CONFIG_NT99141_SUPPORT=n
CONFIG_OV2640_SUPPORT=n
CONFIG_OV3660_SUPPORT=n
CONFIG_GC2145_SUPPORT=n
CONFIG_GC032A_SUPPORT=n
CONFIG_GC0308_SUPPORT=n
CONFIG_BF3005_SUPPORT=n
CONFIG_BF20A6_SUPPORT=n
CONFIG_SC030IOT_SUPPORT=n
CONFIG_HM1055_SUPPORT=n
CONFIG_HM0360_SUPPORT=n
CONFIG_MEGA_CCM_SUPPORT=n
CONFIG_SCCB_CLK_FREQ=400000
CONFIG_CAMERA_PSRAM_DMA=y
